<a href="https://colab.research.google.com/github/EduYeeFra/SQL/blob/main/SQL_course.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Introduction to SQL

## What is SQL?

Structured Query Language also known as SQL is a standardized programming language that is used to manage relational databases and perform various operations on the data in them.

Types of SQL commands

* DDL(Data Definition Language): To make/perform changes to the physical structure of any table residing inside a database, DDL is used. These commands when executed are auto-commit in nature and all the changes in the table are reflected and saved immediately.

* DML(Data Manipulation Language): Once the tables are created and the database is generated using DDL commands, manipulation inside those tables and databases is done using DML commands. The advantage of using DML commands is, that if in case any wrong changes or values are made, they can be changed and rolled back easily.

* DQL(Data Query Language): Data query language consists of only one command upon which data selection in SQL relies. The SELECT command in combination with other SQL clauses is used to retrieve and fetch data from databases/tables based on certain conditions applied by the user.

* DCL(Data Control Language): DCL commands as the name suggests manage the matters and issues related to the data controller in any database. DCL includes commands such as GRANT and REVOKE which mainly deal with the rights, permissions, and other controls of the database system.

* TCL(Transaction Control Language): Transaction Control Language as the name suggests manages the issues and matters related to the transactions in any database. They are used to roll back or commit the changes in the database.

## Purpose of SQL


This database language is mainly designed for maintaining the data in relational database management systems. It is a special tool used by data professionals for handling structured data (data that is stored in the form of tables).

##Data definition & Data Manipulation

SQL commands and syntax

Data Definition Language (DDL) commands are also called data definition commands because they are used to define data tables.


In SQL DDL commands are used to create and modify the structure of a database and database objects.

* CREATE: to create objects in the database.
* ALTER: modifies the database structure.
* DROP: deletes objects from the database.
* TRUNCATE: removes all records from the table, including all spaces allocated to the records.


Data Manipulation Language (DML) commands are used to manipulate data in existing tables by adding, changing or removing data. Unlike DDL commands that define how data is stored, DML commands operate in the tables defined with DDL commands.


* SELECT: to get data from a database.
* INSERT: to insert data into a table.
* UPDATE: to modify existing data within a table.
* DELETE: deletes all records from the table; do not delete spaces assigned to records.

##SQL Application

In [1]:
# Import library
import sqlite3

#Connect to an SQLite database
conn = sqlite3.connect(':memory:')

In [2]:
c = conn.cursor()

c.execute(
    '''
    CREATE TABLE Classmates
    (PersonID, LastName, FirstName, Phone, Residence)
    '''
)

Inserting data into the table

In [3]:
c.execute("INSERT INTO Classmates values (516, 'YEE', 'EDUARDO', '5586974589', 'Atizapan'), (517, 'YEE', 'LORENZO', '5586974588', 'Atizapan') ")
conn.commit()

In [4]:
c.execute("SELECT * FROM Classmates WHERE LastName = 'YEE'")

print(c.fetchall())

[(516, 'YEE', 'EDUARDO', '5586974589', 'Atizapan'), (517, 'YEE', 'LORENZO', '5586974588', 'Atizapan')]

In [5]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.8.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.20)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.19.0)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.39)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)

In [6]:
#Load the SQL extension
%load_ext sql

#Creat a SQLite database
%sql sqlite://

In [7]:
%%sql
CREATE TABLE Classmates (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Phone int,
    Residence varchar(255)
);

INSERT INTO Classmates VALUES(1, 'YEE', 'EDUARDO', '5586974589', 'Atizapan');
INSERT INTO Classmates VALUES(2, 'YEE', 'LORENZO', '5586974588', 'Atizapan');
SELECT * From Classmates;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
Done.

[(1, 'YEE', 'EDUARDO', 5586974589, 'Atizapan'),
 (2, 'YEE', 'LORENZO', 5586974588, 'Atizapan')]

In [8]:
# Example 2
# In this example, we will create a table named Customers
# with the columns Id, Name, Age, Address, Salary.

%%sql
CREATE TABLE if not exists Customers(
   Id,
   Name,
   Age,
   Address,
   Salary
);

SELECT * From Customers;

 * sqlite://
Done.
Done.

[]

In [9]:
%%sql
ALTER TABLE Classmates ADD Gender TEXT;

SELECT * FROM Classmates;

 * sqlite://
Done.
Done.

[(1, 'YEE', 'EDUARDO', 5586974589, 'Atizapan', None),
 (2, 'YEE', 'LORENZO', 5586974588, 'Atizapan', None)]

In [10]:
%%sql
ALTER TABLE Classmates drop column Residence;
SELECT * FROM Classmates;

 * sqlite://
Done.
Done.

[(1, 'YEE', 'EDUARDO', 5586974589, None),
 (2, 'YEE', 'LORENZO', 5586974588, None)]

In [11]:
%%sql
ALTER TABLE Classmates RENAME TO Schoolmates;

 * sqlite://
Done.

[]

In [12]:
%%sql
SELECT PersonID, LastName, Gender FROM Schoolmates;

 * sqlite://
Done.

[(1, 'YEE', None), (2, 'YEE', None)]

In [17]:
%%sql
UPDATE Schoolmates
SET Gender = 'Male'
WHERE LastName = 'YEE';

SELECT * FROM Schoolmates;

 * sqlite://
2 rows affected.
Done.

[(1, 'YEE', 'EDUARDO', 5586974589, 'Male'),
 (2, 'YEE', 'LORENZO', 5586974588, 'Male')]

In [19]:
%%sql
DELETE FROM Schoolmates WHERE FirstName='LORENZO';
SELECT * FROM Schoolmates;

 * sqlite://
0 rows affected.
Done.

[(1, 'YEE', 'EDUARDO', 5586974589, 'Male')]

In [14]:
##%%sql
##DROP TABLE Classmates